#-*-coding:utf-8-*-
x = {'632801': '青海省-海西蒙古族藏族自治州-格尔木市', '632802': '青海省-海西蒙古族藏族自治州-德令哈市', '632821': '青海省-海西蒙古族藏族自治州-乌兰县', '632822': '青海省-海西蒙古族藏族自治州-都兰县', '632823': '青海省-海西蒙古族藏族自治州-天峻县','632701': '青海省-玉树藏族自治州-玉树市', '632722': '青海省-玉树藏族自治州-杂多县', '632723': '青海省-玉树藏族自治州-称多县', '632724': '青海省-玉树藏族自治州-治多县', '632725': '青海省-玉树藏族自治州-囊谦县', '632726': '青海省-玉树藏族自治州-曲麻莱县','632621': '青海省-果洛藏族自治州-玛沁县', '632622': '青海省-果洛藏族自治州-班玛县', '632623': '青海省-果洛藏族自治州-甘德县', '632624': '青海省-果洛藏族自治州-达日县', '632625': '青海省-果洛藏族自治州-久治县', '632626': '青海省-果洛藏族自治州-玛多县','632521': '青海省-海南藏族自治州-共和县', '632522': '青海省-海南藏族自治州-同德县', '632523': '青海省-海南藏族自治州-贵德县', '632524': '青海省-海南藏族自治州-兴海县', '632525': '青海省-海南藏族自治州-贵南县', '632321': '青海省-黄南藏族自治州-同仁县', '632322': '青海省-黄南藏族自治州-尖扎县', '632323': '青海省-黄南藏族自治州-泽库县', '632324': '青海省-黄南藏族自治州-河南蒙古族自治县','632221': '青海省-海北藏族自治州-门源回族自治县', '632222': '青海省-海北藏族自治州-祁连县', '632223': '青海省-海北藏族自治州-海晏县', '632224': '青海省-海北藏族自治州-刚察县', '630202': '青海省-海东市-乐都区', '630203': '青海省-海东市-平安区', '630222': '青海省-海东市-民和回族土族自治县', '630223': '青海省-海东市-互助土族自治县', '630224': '青海省-海东市-化隆回族自治县', '630225': '青海省-海东市-循化撒拉族自治县','630102': '青海省-西宁市-城东区', '630103': '青海省-西宁市-城中区', '630104': '青海省-西宁市-城西区', '630105': '青海省-西宁市-城北区', '630121': '青海省-西宁市-大通回族土族自治县', '630122': '青海省-西宁市-湟中县', '630123': '青海省-西宁市-湟源县'}

print(len(x))

jianzhu = {"code":200,"data":[{"region_id":"632801","region_name":"格尔木","region_fullname":"青海省-海西蒙古族藏族自治州-格尔木市"},{"region_id":"632802","region_name":"德令哈","region_fullname":"青海省-海西蒙古族藏族自治州-德令哈市"},{"region_id":"632821","region_name":"乌兰县","region_fullname":"青海省-海西蒙古族藏族自治州-乌兰县"},{"region_id":"632822","region_name":"都兰县","region_fullname":"青海省-海西蒙古族藏族自治州-都兰县"},{"region_id":"632823","region_name":"天峻县","region_fullname":"青海省-海西蒙古族藏族自治州-天峻县"}],"message":"","success":"true"}

item = {}
for i in jianzhu['data']:
    item[i['region_id']] = i['region_fullname']
print(item)

for i in range(0,40):
    print(i)


with open('中国市场.txt', 'r') as f:
    count = f.read()
    count = set(count.split('\n'))


f.close()
print(list(count))