#
# import requests
# import jsonpath
# url = 'https://y.qianzhan.com/system/InitTree2?keyStr=&prevStr=&nodeType=2&match=0'
# res = requests.get(url).json()
# ind = jsonpath.jsonpath(res,'$..name')[1::]
# print(ind)


def ind():
    ind_list = ['物流园', '电子商务', '文化', '电子', '文化创意', '现代农业', '智能', '汽车', '食品', '健康', '医药', '智能制造', 'IT软件', '环保', '新材料', '互联网', '跨境电商', '材料', '人力资源', '化工', '光电', '服装', '能源', '循环经济', '生物科技', '国家大学', '纺织', '新能源', '保税区', '电子信息', '医疗', '教育', '家居', '建材', '建筑', '农产品', '金融', '生物医药', '艺术', '大数据', '生态农业', '电商物流', '广告', '时尚', '机电', '家具', '航空航天', '节能', '影视', '航空', '医疗器械', '大健康', '包装印刷', '物联网', '特色小镇', '体育', '机器人', '汽车零部件', '电器', '陶瓷', '酒', '光伏', '冷链物流', '新兴产业', '模具', '动漫', '通信', '高端装备', '新能源汽车', '珠宝', '激光', '精细化工', '轻纺', '人工智能', '汽车文化', '工业设计', '电气', '半导体', '云计算', '军民融合', '玻璃', '丝绸', '中医药', '集成电路', 'LED照明', '生命科学', '医药物流', '汽车物流', '3D打印', '知识产权', '基金', '游戏', '汽车电子', '音乐', '煤化工', '光通信', '智能电网', '海洋生物', '无人机', '智能物流', '互联网金融', '盐化工', '多媒体', '汽车后市场', '新能源装备', '生物材料', '智能交通', '天然气', '工业园', '汽车商贸']
    return ind_list
